IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28004x_erad_counter_regs.xml
<module id="ERAD_COUNTER_REGS" HW_revision="" description="ERAD COUNTER Registers">
	<register id="CTM_CNTL" width="16" page="1" offset="0x0" internal="0" description="Counter Control Register">
		<bitfield id="START_STOP_MODE" description="Start_stop mode bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EVENT_MODE" description="Event mode bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="RST_ON_MATCH" description="Reset_on_match bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="STOP" description="Stop bit (Halt/No Halt of CPU)" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="RTOSINT" description="RTOSINT bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="RST_EN" description="Enable Reset" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="RST_INP_SEL" description="Reset Input select" begin="15" end="11" width="5" rwaccess="RW"/>
	</register>
	<register id="CTM_STATUS" width="16" page="1" offset="0x1" internal="0" description="Counter Status Register">
		<bitfield id="EVENT_FIRED" description="Counter Event Fired bits" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="OVERFLOW" description="Counter Overflowed" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="MODULE_ID" description="Identification bits" begin="11" end="2" width="10" rwaccess="R"/>
		<bitfield id="STATUS" description="Status bits" begin="15" end="12" width="4" rwaccess="R"/>
	</register>
	<register id="CTM_REF" width="32" page="1" offset="0x2" internal="0" description="Counter Reference Register">
		<bitfield id="REF" description="The counter reference register" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CTM_COUNT" width="32" page="1" offset="0x4" internal="0" description="Counter Current Value Register">
		<bitfield id="COUNT" description="The counter value register" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CTM_MAX_COUNT" width="32" page="1" offset="0x6" internal="0" description="Counter Max Count Value Register">
		<bitfield id="MAX_COUNT" description="The maximum recorded counter value." begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CTM_INPUT_SEL" width="16" page="1" offset="0x8" internal="0" description="Counter Input Select Register">
		<bitfield id="CTM_INP_SEL_EN" description="Count input select enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CNT_INP_SEL" description="Count input select" begin="5" end="1" width="5" rwaccess="RW"/>
		<bitfield id="STA_INP_SEL" description="Start input select" begin="10" end="6" width="5" rwaccess="RW"/>
		<bitfield id="STO_INP_SEL" description="Stop input select" begin="15" end="11" width="5" rwaccess="RW"/>
	</register>
	<register id="CTM_CLEAR" width="16" page="1" offset="0x9" internal="0" description="Counter Clear Register">
		<bitfield id="EVENT_CLEAR" description="Clear EVENT_FIRED" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="OVERFLOW_CLEAR" description="Clear OVERFLOW" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
</module>
